In [1]:
# pandas give two primary data structure 1. Series and 2.DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [2]:
import pandas as pd

In [3]:
# 1. Creating a Series
data = [10, 20, 30, 40, 50]
series = pd.Series(data) # key is default index 0,1,2,3... 
print("Series:\n", series)

Series:
 0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
# 1. Creating a Series
data = [[10, 20], [30, 40], [50, 60]]#2D list but it will be treated as 1D list as a single object because Series is 1D
series = pd.Series(data)
print("Series:\n", series)
print(type(series))

Series:
 0    [10, 20]
1    [30, 40]
2    [50, 60]
dtype: object
<class 'pandas.core.series.Series'>

In [5]:
# also ewe can create series from dictionary
data = {'a': 10, 'b': 20, 'c': 30}
series = pd.Series(data)
print("Series from dictionary:\n", series)

Series from dictionary:
 a    10
b    20
c    30
dtype: int64

In [6]:
data= [10, 20, 30]
index=['i','ii','iii']
series= pd.Series(data, index=index)
print( series)

i      10
ii     20
iii    30
dtype: int64

In [7]:
# data frame 
# create a df from dictionary
data = {
    'Name': ['ram', 'Bob', 'sam'],
    'Age': [25, 30, 35],
    'City': ['nep', 'ind', 'jpn']
}
 
df= pd.DataFrame(data)
print(df)

  Name  Age City
0  ram   25  nep
1  Bob   30  ind
2  sam   35  jpn

In [8]:
# create df from lost of dictionaries
data = [
    {'Name': 'ram', 'Age': 25, 'City': 'nep'},
    { 'Age': 30, 'City': 'ind','Name': 'Bob',},
    {'Name': 'sam', 'Age': 35, 'City': 'jpn'}
]
namedf = pd.DataFrame(data)
print(namedf)

  Name  Age City
0  ram   25  nep
1  Bob   30  ind
2  sam   35  jpn

In [9]:
df = pd.read_csv('data.csv').head(5)
# print(df.head(n=5))
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
type(df['Date'])  # Accessing a single column

pandas.core.series.Series

In [12]:
# print(df.loc[0])  # Accessing a single row by label (index)
print(namedf.loc[0][0])  # Accessing a single row by label (index)

ram

/var/folders/lq/9807c0hd61d22rh4kpl7pvrc0000gn/T/ipykernel_24547/2663987016.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(namedf.loc[0][0])  # Accessing a single row by label (index)

In [13]:
# df.iloc[0]  # Accessing a single row by position (index)
namedf.iloc[0][0]  # Accessing a single row by position (index)

/var/folders/lq/9807c0hd61d22rh4kpl7pvrc0000gn/T/ipykernel_24547/1221299728.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  namedf.iloc[0][0]  # Accessing a single row by position (index)

'ram'

# Understanding `loc` vs `iloc` in Pandas

**Key Differences:**
- **`loc`**: Label-based indexing (uses index names/labels)
- **`iloc`**: Integer position-based indexing (uses numeric positions)

**Syntax:**
- `df.loc[row_indexer, column_indexer]`
- `df.iloc[row_position, column_position]`

In [14]:
# Create a sample DataFrame with custom index for demonstration
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['NYC', 'LA', 'Chicago', 'Miami', 'Boston'],
    'Salary': [50000, 60000, 70000, 55000, 65000]
}

# Custom index labels
custom_index = ['emp1', 'emp2', 'emp3', 'emp4', 'emp5']
sample_df = pd.DataFrame(data, index=custom_index)
print("Sample DataFrame:")
print(sample_df)
print("\nDataFrame info:")
print(f"Index: {sample_df.index.tolist()}")
print(f"Columns: {sample_df.columns.tolist()}")

Sample DataFrame:
         Name  Age     City  Salary
emp1    Alice   25      NYC   50000
emp2      Bob   30       LA   60000
emp3  Charlie   35  Chicago   70000
emp4    Diana   28    Miami   55000
emp5      Eve   32   Boston   65000

DataFrame info:
Index: ['emp1', 'emp2', 'emp3', 'emp4', 'emp5']
Columns: ['Name', 'Age', 'City', 'Salary']

## 1. Using `loc` - Label-based Indexing

In [15]:
# loc uses INDEX LABELS and COLUMN NAMES

# 1. Select single row by label
print("1. Single row by label (emp2):")
print(sample_df.loc['emp2'])
print()

# 2. Select specific cell by row and column labels
print("2. Specific cell (emp3, Age):")
print(sample_df.loc['emp3', 'Age'])
print()

# 3. Select multiple rows by labels
print("3. Multiple rows (emp1 and emp3):")
print(sample_df.loc[['emp1', 'emp3']])
print()

# 4. Select rows and specific columns
print("4. Specific rows and columns:")
print(sample_df.loc[['emp2', 'emp4'], ['Name', 'Salary']])
print()

# 5. Slice rows by labels (inclusive on both ends)
print("5. Slice rows from emp2 to emp4:")
print(sample_df.loc['emp2':'emp4'])  # Note: includes both emp2 and emp4

1. Single row by label (emp2):
Name        Bob
Age          30
City         LA
Salary    60000
Name: emp2, dtype: object

2. Specific cell (emp3, Age):
35

3. Multiple rows (emp1 and emp3):
         Name  Age     City  Salary
emp1    Alice   25      NYC   50000
emp3  Charlie   35  Chicago   70000

4. Specific rows and columns:
       Name  Salary
emp2    Bob   60000
emp4  Diana   55000

5. Slice rows from emp2 to emp4:
         Name  Age     City  Salary
emp2      Bob   30       LA   60000
emp3  Charlie   35  Chicago   70000
emp4    Diana   28    Miami   55000

## 2. Using `iloc` - Position-based Indexing

In [16]:
# iloc uses INTEGER POSITIONS (0-based indexing)

# 1. Select single row by position
print("1. Single row by position (row 1):")
print(sample_df.iloc[1])  # Second row (Bob)
print()

# 2. Select specific cell by row and column positions
print("2. Specific cell (row 2, column 1):")
print(sample_df.iloc[2, 1])  # Charlie's Age
print()

# 3. Select multiple rows by positions
print("3. Multiple rows (positions 0 and 2):")
print(sample_df.iloc[[0, 2]])  # Alice and Charlie
print()

# 4. Select rows and specific columns by positions
print("4. Specific rows and columns by position:")
print(sample_df.iloc[[1, 3], [0, 3]])  # Rows 1,3 and columns 0,3 (Name, Salary)
print()

# 5. Slice rows by positions (exclusive end)
print("5. Slice rows from position 1 to 3:")
print(sample_df.iloc[1:4])  # Rows 1, 2, 3 (excludes row 4)
print()

# 6. Negative indexing
print("6. Last row using negative indexing:")
print(sample_df.iloc[-1])  # Last row (Eve)

1. Single row by position (row 1):
Name        Bob
Age          30
City         LA
Salary    60000
Name: emp2, dtype: object

2. Specific cell (row 2, column 1):
35

3. Multiple rows (positions 0 and 2):
         Name  Age     City  Salary
emp1    Alice   25      NYC   50000
emp3  Charlie   35  Chicago   70000

4. Specific rows and columns by position:
       Name  Salary
emp2    Bob   60000
emp4  Diana   55000

5. Slice rows from position 1 to 3:
         Name  Age     City  Salary
emp2      Bob   30       LA   60000
emp3  Charlie   35  Chicago   70000
emp4    Diana   28    Miami   55000

6. Last row using negative indexing:
Name         Eve
Age           32
City      Boston
Salary     65000
Name: emp5, dtype: object

## 3. Boolean Indexing with `loc`

In [17]:
# Boolean indexing with loc - very powerful for filtering

# 1. Filter rows based on condition
print("1. Employees with Age > 30:")
print(sample_df.loc[sample_df['Age'] > 30])
print()

# 2. Multiple conditions
print("2. Employees with Age > 28 AND Salary > 55000:")
condition = (sample_df['Age'] > 28) & (sample_df['Salary'] > 55000)
print(sample_df.loc[condition])
print()

# 3. Filter rows and select specific columns
print("3. Names of employees in NYC or LA:")
city_condition = sample_df['City'].isin(['NYC', 'LA'])
print(sample_df.loc[city_condition, ['Name', 'City']])
print()

# 4. Using string methods in conditions
print("4. Employees whose name contains 'e':")
name_condition = sample_df['Name'].str.contains('e', case=False)
print(sample_df.loc[name_condition, ['Name', 'Age']])

1. Employees with Age > 30:
         Name  Age     City  Salary
emp3  Charlie   35  Chicago   70000
emp5      Eve   32   Boston   65000

2. Employees with Age > 28 AND Salary > 55000:
         Name  Age     City  Salary
emp2      Bob   30       LA   60000
emp3  Charlie   35  Chicago   70000
emp5      Eve   32   Boston   65000

3. Names of employees in NYC or LA:
       Name City
emp1  Alice  NYC
emp2    Bob   LA

4. Employees whose name contains 'e':
         Name  Age
emp1    Alice   25
emp3  Charlie   35
emp5      Eve   32

## 4. Modifying Data with `loc` and `iloc`

In [18]:
# Create a copy for modification examples
df_copy = sample_df.copy()

print("Original DataFrame:")
print(df_copy)
print()

# 1. Modify single value using loc
df_copy.loc['emp2', 'Age'] = 31
print("1. After modifying Bob's age using loc:")
print(df_copy)
print()

# 2. Modify single value using iloc
df_copy.iloc[0, 1] = 26  # Alice's age (row 0, column 1)
print("2. After modifying Alice's age using iloc:")
print(df_copy)
print()

# 3. Modify multiple values based on condition
df_copy.loc[df_copy['Salary'] < 60000, 'Salary'] = df_copy['Salary'] * 1.1
print("3. After giving 10% raise to employees with salary < 60000:")
print(df_copy)

Original DataFrame:
         Name  Age     City  Salary
emp1    Alice   25      NYC   50000
emp2      Bob   30       LA   60000
emp3  Charlie   35  Chicago   70000
emp4    Diana   28    Miami   55000
emp5      Eve   32   Boston   65000

1. After modifying Bob's age using loc:
         Name  Age     City  Salary
emp1    Alice   25      NYC   50000
emp2      Bob   31       LA   60000
emp3  Charlie   35  Chicago   70000
emp4    Diana   28    Miami   55000
emp5      Eve   32   Boston   65000

2. After modifying Alice's age using iloc:
         Name  Age     City  Salary
emp1    Alice   26      NYC   50000
emp2      Bob   31       LA   60000
emp3  Charlie   35  Chicago   70000
emp4    Diana   28    Miami   55000
emp5      Eve   32   Boston   65000

3. After giving 10% raise to employees with salary < 60000:
         Name  Age     City   Salary
emp1    Alice   26      NYC  55000.0
emp2      Bob   31       LA  60000.0
emp3  Charlie   35  Chicago  70000.0
emp4    Diana   28    Miami  60500.0
emp5      Eve   32   Boston  65000.0

/var/folders/lq/9807c0hd61d22rh4kpl7pvrc0000gn/T/ipykernel_24547/1762362919.py:21: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '[55000. 60500.]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df_copy.loc[df_copy['Salary'] < 60000, 'Salary'] = df_copy['Salary'] * 1.1

## 5. Key Differences Summary

| Aspect | `loc` | `iloc` |
|--------|-------|--------|
| **Indexing Type** | Label-based | Position-based |
| **Row Selection** | Uses index labels | Uses integer positions (0, 1, 2...) |
| **Column Selection** | Uses column names | Uses integer positions (0, 1, 2...) |
| **Slicing** | Inclusive on both ends | Exclusive end (like Python lists) |
| **Boolean Indexing** | ✅ Supported | ❌ Not directly supported |
| **Negative Indexing** | ❌ Not supported | ✅ Supported |

## 6. When to Use Which?

- **Use `loc` when:**
  - You know the index labels and column names
  - You want to filter data based on conditions
  - You're working with meaningful index labels
  - You need inclusive slicing

- **Use `iloc` when:**
  - You want to select by position regardless of labels
  - You're working with numeric positions
  - You need to select first/last n rows/columns
  - You want Python-like slicing behavior

In [19]:
# Quick comparison examples
print("=== QUICK COMPARISON ===")
print("\n1. Same result, different methods:")
print("loc['emp2', 'Name']:", sample_df.loc['emp2', 'Name'])
print("iloc[1, 0]:", sample_df.iloc[1, 0])

print("\n2. Slicing differences:")
print("loc['emp2':'emp4'] - INCLUSIVE:")
print(sample_df.loc['emp2':'emp4'].index.tolist())
print("iloc[1:4] - EXCLUSIVE:")
print(sample_df.iloc[1:4].index.tolist())

print("\n3. First 3 rows:")
print("Using iloc (more common for this):")
print(sample_df.iloc[:3])

print("\n4. Boolean indexing (only loc):")
print("High earners (>60000):")
print(sample_df.loc[sample_df['Salary'] > 60000, ['Name', 'Salary']])

=== QUICK COMPARISON ===

1. Same result, different methods:
loc['emp2', 'Name']: Bob
iloc[1, 0]: Bob

2. Slicing differences:
loc['emp2':'emp4'] - INCLUSIVE:
['emp2', 'emp3', 'emp4']
iloc[1:4] - EXCLUSIVE:
['emp2', 'emp3', 'emp4']

3. First 3 rows:
Using iloc (more common for this):
         Name  Age     City  Salary
emp1    Alice   25      NYC   50000
emp2      Bob   30       LA   60000
emp3  Charlie   35  Chicago   70000

4. Boolean indexing (only loc):
High earners (>60000):
         Name  Salary
emp3  Charlie   70000
emp5      Eve   65000

In [20]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['NYC', 'LA', 'Chicago', 'Miami', 'Boston'],
    'Salary': [50000, 60000, 70000, 55000, 65000]
}
custom_index = ['emp1', 'emp2', 'emp3', 'emp4', 'emp5']

In [21]:
df=pd.DataFrame(data,custom_index)
print(df)
print(df.loc['emp1'][0])    
print(df.iloc[0][0])
print(df.at['emp2','Name'])
print(df.at['emp2','Name'])#it takes key custom index emp1,emp2,.... 
print(df.iat[2,0])#it takes index defult index 0,1,2....

         Name  Age     City  Salary
emp1    Alice   25      NYC   50000
emp2      Bob   30       LA   60000
emp3  Charlie   35  Chicago   70000
emp4    Diana   28    Miami   55000
emp5      Eve   32   Boston   65000
Alice
Alice
Bob
Bob
Charlie

/var/folders/lq/9807c0hd61d22rh4kpl7pvrc0000gn/T/ipykernel_24547/2578418629.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc['emp1'][0])
/var/folders/lq/9807c0hd61d22rh4kpl7pvrc0000gn/T/ipykernel_24547/2578418629.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[0][0])

In [22]:
df.drop('emp5', axis=0, inplace=True)
df

         Name  Age     City  Salary
emp1    Alice   25      NYC   50000
emp2      Bob   30       LA   60000
emp3  Charlie   35  Chicago   70000
emp4    Diana   28    Miami   55000

In [23]:
#drop column
df.drop(['Salary', 'Age'], axis=1, inplace=True) #axis=1 for column, axis=0 for row
df

         Name     City
emp1    Alice      NYC
emp2      Bob       LA
emp3  Charlie  Chicago
emp4    Diana    Miami

In [25]:
# add a new column
df['salary'] = [70000, 80000, 120000, 90000]
df

         Name     City Country  salary
emp1    Alice      NYC     USA   70000
emp2      Bob       LA     USA   80000
emp3  Charlie  Chicago     USA  120000
emp4    Diana    Miami     USA   90000

In [26]:
df.describe()

              salary
count       4.000000
mean    90000.000000
std     21602.468995
min     70000.000000
25%     77500.000000
50%     85000.000000
75%     97500.000000
max    120000.000000

In [29]:
df.dtypes

Name       object
City       object
Country    object
salary      int64
dtype: object

In [70]:
# data manipulation and cleaning
df= pd.read_csv('data.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  50 non-null     object
 2   Value     46 non-null     float64
 3   Product   48 non-null     object
 4   Sales     46 non-null     float64
 5   Region    49 non-null     object
dtypes: float64(2), object(4)
memory usage: 2.5+ KB

In [71]:
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0    NaN
1  2023-01-02        B    NaN       NaN  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0       NaN  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [72]:
#  handling missing values
df.isnull().sum()

Date        0
Category    0
Value       4
Product     2
Sales       4
Region      1
dtype: int64

In [73]:
df.fillna(0).head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0      0
1  2023-01-02        B    0.0         0  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0         0  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [74]:
df['Sales_fill']= df['Sales'].fillna(df['Sales'].mean())
df.head(5)

         Date Category  Value   Product  Sales Region  Sales_fill
0  2023-01-01        A   28.0  Product1  754.0    NaN       754.0
1  2023-01-02        B    NaN       NaN  110.0  North       110.0
2  2023-01-03        C   32.0  Product2  398.0   East       398.0
3  2023-01-04        B    8.0       NaN  522.0   East       522.0
4  2023-01-05        B   26.0  Product3  869.0  North       869.0

In [75]:
df['Product'].mode()[0]  # most frequent value

'Product3'

In [76]:
df['Product_fill']= df['Product'].fillna(df['Product'].mode()[0])
df.head(5)

         Date Category  Value   Product  Sales Region  Sales_fill Product_fill
0  2023-01-01        A   28.0  Product1  754.0    NaN       754.0     Product1
1  2023-01-02        B    NaN       NaN  110.0  North       110.0     Product3
2  2023-01-03        C   32.0  Product2  398.0   East       398.0     Product2
3  2023-01-04        B    8.0       NaN  522.0   East       522.0     Product3
4  2023-01-05        B   26.0  Product3  869.0  North       869.0     Product3

In [77]:
df.describe()

           Value       Sales  Sales_fill
count  46.000000   46.000000   50.000000
mean   52.021739  557.130435  557.130435
std    29.308694  274.598584  263.151901
min     2.000000  108.000000  108.000000
25%    27.250000  339.000000  356.000000
50%    55.000000  591.500000  578.000000
75%    70.000000  767.500000  749.750000
max    99.000000  992.000000  992.000000

In [78]:
df.dtypes

Date             object
Category         object
Value           float64
Product          object
Sales           float64
Region           object
Sales_fill      float64
Product_fill     object
dtype: object

In [79]:
df=df.rename(columns={'Date':"Sales Date"})
df.head(5)

   Sales Date Category  Value   Product  Sales Region  Sales_fill Product_fill
0  2023-01-01        A   28.0  Product1  754.0    NaN       754.0     Product1
1  2023-01-02        B    NaN       NaN  110.0  North       110.0     Product3
2  2023-01-03        C   32.0  Product2  398.0   East       398.0     Product2
3  2023-01-04        B    8.0       NaN  522.0   East       522.0     Product3
4  2023-01-05        B   26.0  Product3  869.0  North       869.0     Product3

In [82]:
# change data type
df['New_value']= df['Value'].fillna(df['Value'].mean()).astype(int)
df.head(5)

,Sales Date,Category,Value,Product,Sales,Region,Sales_fill,Product_fill,New_value
0,2023-01-01,A,28.0,Product1,754.0,NaN,754.0,Product1,28
1,2023-01-02,B,NaN,NaN,110.0,North,110.0,Product3,52
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,Product2,32
3,2023-01-04,B,8.0,NaN,522.0,East,522.0,Product3,8
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,Product3,26

In [83]:
df['Price']= df['New_value'].apply(lambda x:x*1.234)
df.head(5)

,Sales Date,Category,Value,Product,Sales,Region,Sales_fill,Product_fill,New_value,Price
0,2023-01-01,A,28.0,Product1,754.0,NaN,754.0,Product1,28,34.552
1,2023-01-02,B,NaN,NaN,110.0,North,110.0,Product3,52,64.168
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,Product2,32,39.488
3,2023-01-04,B,8.0,NaN,522.0,East,522.0,Product3,8,9.872
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,Product3,26,32.084

In [85]:
df["Sales Date"]= pd.to_datetime(df["Sales Date"])

In [95]:
df.head(5)
df.dtypes

Sales Date      datetime64[ns]
Category                object
Value                  float64
Product                 object
Sales                  float64
Region                  object
Sales_fill             float64
Product_fill            object
New_value                int64
Price                  float64
dtype: object

In [ ]:
# data aggregation and grouping
grouped_product= df.groupby('Product')['Value'].sum()

In [93]:
print(grouped_product)

Product
Product1    49.153846
Product2    52.800000
Product3    56.117647
Name: Value, dtype: float64

In [104]:
group1=df.groupby(['Product','Region'])['Value'].sum()
print(group1)

Product   Region
Product1  East      256.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     164.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [108]:
groupByRegion= df.groupby('Region')['Value'].agg(['sum','mean','max'])
print(groupByRegion)

           sum       mean   max
Region
East     522.0  43.500000  97.0
North    300.0  37.500000  71.0
South    496.0  62.000000  94.0
West    1047.0  61.588235  99.0

In [109]:
#merge and join df
df1= pd.DataFrame({
    'key':['A','B','C','D'],
    'value1':[1,2,3,4]
})
df2= pd.DataFrame({
    'key':['B','C','D','E'],  
    'value2':[5,6,7,8]
})
print(df1)
print(df2)

  key  value1
0   A       1
1   B       2
2   C       3
3   D       4
  key  value2
0   B       5
1   C       6
2   D       7
3   E       8

In [110]:
pd.merge(df1, df2, on ='key', how='inner')  # inner join

  key  value1  value2
0   B       2       5
1   C       3       6
2   D       4       7

In [111]:
pd.merge(df1, df2, on ='key', how='outer')  # outer join

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     5.0
2   C     3.0     6.0
3   D     4.0     7.0
4   E     NaN     8.0

In [114]:
pd.merge(df1, df2, on ='key', how='left')  # left join

  key  value1  value2
0   A       1     NaN
1   B       2     5.0
2   C       3     6.0
3   D       4     7.0

In [115]:
pd.merge(df1, df2, on ='key', how='right')  # right join

  key  value1  value2
0   B     2.0       5
1   C     3.0       6
2   D     4.0       7
3   E     NaN       8